# while 개념

# 소소코드 4대요소 -> 자료, 변수, 조건, 반복


# while : True인 동안은 계속 반복 실행


# 무한 반복 구조.
# while True :
#     print("무한 반복")


# 무한 반복은 사용이 제한적이므로 반복문을 제어할 필요가 있다.
# 반복문 제어 -> 횟수 세기. 
count = 0 # 반복횟수

while count < 10 : # count가 3이 될 때 False로 만들기
    # =============
    print("안녕하세요")
    # ===========
    count += 1

# =====================================================
# 반복문은 수열을 만드는데 유용하다.
# 수열 만들기
count = 5 #시작수

while count <= 50 : #  끝수
    # =============
    print(count)
    # ===========
    count += 5 # 증가량
